export class ExpressaoRegular {
  expressaoNome: string = '^([\\\'\\.\\^\\~\\´\\`\\\\áÁ\\\\àÀ\\\\ãÃ\\\\âÂ\\\\éÉ\\\\èÈ\\\\êÊ\\\\íÍ\\\\ìÌ\\\\óÓ\\\\òÒ\\\\õÕ\\\\ôÔ\\\\úÚ\\\\ùÙ\\\\çÇaA-zZ]+)+((\\s[\\\'\\.\\^\\~\\´\\`\\\\áÁ\\\\àÀ\\\\ãÃ\\\\âÂ\\\\éÉ\\\\èÈ\\\\êÊ\\\\íÍ\\\\ìÌ\\\\óÓ\\\\òÒ\\\\õÕ\\\\ôÔ\\\\úÚ\\\\ùÙ\\\\çÇaA-zZ]+)+)?$';
  expressaoTelefone: string = '^(\\([0-9]{2}\\))\\d{4,5}-\\d{4,5}$'
  expressaoEmail:string ='[a-z0-9!#$%&\'*+/=?^_`{|}~-]+(?:\\.[a-z0-9!#$%&\'*+/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?'
}
